### Eksik Veriler

#### Numpy da boş veriyi "np.nan" şeklinde oluşturabiliriz.

In [1]:
import numpy as np
import pandas as pd

In [13]:
havaDurumuSozluk={"Ankara":[20,15,np.nan],"Adana":[25,30,25],"Mersin":[np.nan,np.nan,15]}

In [14]:
dataFrame=pd.DataFrame(havaDurumuSozluk)

In [15]:
dataFrame

   Ankara  Adana  Mersin
0    20.0     25     NaN
1    15.0     30     NaN
2     NaN     25    15.0

In [16]:
#Satırda ve sütünda nan deger varsa çıkartır.
dataFrame.dropna()

Empty DataFrame
Columns: [Ankara, Adana, Mersin]
Index: []

In [17]:
dataFrame

   Ankara  Adana  Mersin
0    20.0     25     NaN
1    15.0     30     NaN
2     NaN     25    15.0

In [18]:
#Kolona göre bol olmayan tek kolon geldi.
dataFrame.dropna(axis=1)

   Adana
0     25
1     30
2     25

#### *thresh kullanarak  sınırlama koyabiliriz.

In [19]:
dataFrame.dropna(axis=1,thresh=2)

   Ankara  Adana
0    20.0     25
1    15.0     30
2     NaN     25

#### "fillna() ile boş olanları doldururuz"

In [20]:
dataFrame.fillna(20)

   Ankara  Adana  Mersin
0    20.0     25    20.0
1    15.0     30    20.0
2    20.0     25    15.0

 ## Groupby

In [21]:
dersler={"dersAdi":["Fizik","Kimya","Matematik","Biyoloji","Tarih","Coğrafya"],
        "dersKodu":["F012","K458","M469","B478","T158","C963"],
         "hocalar":["Ahmet","Mehmet","Fatma","Kerim","Hamza","Fatih"],
         "alanlar":["Sayısal","Sayısal","Sayısal","Sayısal","Sözel","Sözel"],
         "Maas":[50.000,40.000,60.000,50.000,40.000,40.000]
        
        }

In [22]:
dersler

{'dersAdi': ['Fizik', 'Kimya', 'Matematik', 'Biyoloji', 'Tarih', 'Coğrafya'],
 'dersKodu': ['F012', 'K458', 'M469', 'B478', 'T158', 'C963'],
 'hocalar': ['Ahmet', 'Mehmet', 'Fatma', 'Kerim', 'Hamza', 'Fatih'],
 'alanlar': ['Sayısal', 'Sayısal', 'Sayısal', 'Sayısal', 'Sözel', 'Sözel'],
 'Maas': [50.0, 40.0, 60.0, 50.0, 40.0, 40.0]}

In [23]:
dersler_Dataframe=pd.DataFrame(dersler)

In [24]:
dersler_Dataframe

     dersAdi dersKodu hocalar  alanlar  Maas
0      Fizik     F012   Ahmet  Sayısal  50.0
1      Kimya     K458  Mehmet  Sayısal  40.0
2  Matematik     M469   Fatma  Sayısal  60.0
3   Biyoloji     B478   Kerim  Sayısal  50.0
4      Tarih     T158   Hamza    Sözel  40.0
5   Coğrafya     C963   Fatih    Sözel  40.0

In [25]:
grupla=dersler_Dataframe.groupby("alanlar")

In [26]:
grupla.count()

         dersAdi  dersKodu  hocalar  Maas
alanlar
Sayısal        4         4        4     4
Sözel          2         2        2     2

In [27]:
grupla.describe()

         Maas
        count  mean       std   min   25%   50%   75%   max
alanlar
Sayısal   4.0  50.0  8.164966  40.0  47.5  50.0  52.5  60.0
Sözel     2.0  40.0  0.000000  40.0  40.0  40.0  40.0  40.0

In [28]:
grupla.max()

           dersAdi dersKodu hocalar  Maas
alanlar
Sayısal  Matematik     M469  Mehmet  60.0
Sözel        Tarih     T158   Hamza  40.0

In [29]:
grupla.min()

          dersAdi dersKodu hocalar  Maas
alanlar
Sayısal  Biyoloji     B478   Ahmet  40.0
Sözel    Coğrafya     C963   Fatih  40.0

## Concatenation

In [45]:
sozluk1={"İsimler":["ALi","Ahmet","Fatma"] , "Yas":[20,24,30]}
sozluk2={"İsimler":["Afra","Kerim","Fatma"] , "Yas":[25,20,33]}
sozluk3={"İsimler":["Arif","Meryem","Kasım"] , "Yas":[18,30,17]}

In [46]:
dataFrame1=pd.DataFrame(sozluk1)
dataFrame2=pd.DataFrame(sozluk2)
dataFrame3=pd.DataFrame(sozluk3)

In [48]:
birlesim=pd.concat([dataFrame1,dataFrame2,dataFrame3])

In [49]:
birlesim

  İsimler  Yas
0     ALi   20
1   Ahmet   24
2   Fatma   30
0    Afra   25
1   Kerim   20
2   Fatma   33
0    Arif   18
1  Meryem   30
2   Kasım   17

#####  ***Sütün sayısı ve adlar aynı olan 3 sözlük yazdık dataframe çevirdik şimdi birleştiricez

In [50]:
#pd.concat(dataFrame1,dataFrame2,dataFrame3)

## Merge

#### ***2 tablo bir ortak kolon

In [51]:
#pd.merge(dataframe1,dataframe2,on="x"(ortak kolon ismi merge ile olur))

###

##### Onceki maas sözlük örneği gibi bir örnek üzerinden ileri uygulama

In [52]:
#Dataframe çevir
#dataFrame["x"].unique()
#dataFrame["x"].nunique()
#dataFrame["x"].value_counts()
#Fonksiyonları dataFramelere uygulayabiliriz.
#dataFrame["x"].apply(uygulanacakfonksiyonadi)
#dataFrame.isnull()
#karakter sözlüğü oluştur dataFrame çevir sonra;
#dataFrame.pivot_table(values=x,index=[a,b],aggfunc=np.sum)